; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v9 ?v3)
             (pred_3 ?v2 ?v7)
             (pred_12 ?v9 ?v7)
             (pred_11 ?v10 ?v9 )
	     (pred_7 ?v9)
             (pred_6 ?v1)
             (pred_1 ?v2)
             (pred_5 ?v7)
             (pred_10 ?v9)
             (pred_2 ?v2)
             (pred_4 ?v9)
             (pred_8 ))



(:action op_5
:parameters (?v12 ?v8 ?v13 ?v11)
:precondition (and (pred_6 ?v12) (pred_6 ?v8) (pred_1 ?v13) (pred_5 ?v11)
          (pred_9 ?v12 ?v8) (pred_3 ?v13 ?v11)
                   (pred_12 ?v8 ?v11) (pred_7 ?v12) 
                   (pred_10 ?v8) (pred_2 ?v13))
:effect (and  (pred_4 ?v8) (not (pred_10 ?v8))))


(:action op_3
:parameters (?v12 ?v5)
:precondition (and (pred_6 ?v12) (pred_6 ?v5)
               (pred_7 ?v12) (pred_9 ?v12 ?v5) (pred_4 ?v5))
:effect (and (pred_7 ?v5) (not (pred_7 ?v12))))

(:action op_1
:parameters (?v12 ?v13)
:precondition (and (pred_6 ?v12) (pred_1 ?v13) 
                  (pred_7 ?v12) (pred_11 ?v13 ?v12) (pred_8 ))
:effect (and (pred_2 ?v13)
   (not (pred_11 ?v13 ?v12)) (not (pred_8 ))))


(:action op_4
:parameters (?v12 ?v4 ?v6)
:precondition (and (pred_6 ?v12) (pred_1 ?v4) (pred_1 ?v6)
                  (pred_7 ?v12) (pred_2 ?v6) (pred_11 ?v4 ?v12))
:effect (and (pred_2 ?v4) (pred_11 ?v6 ?v12)
        (not (pred_2 ?v6)) (not (pred_11 ?v4 ?v12))))

(:action op_2
:parameters (?v12 ?v13)
:precondition (and (pred_6 ?v12) (pred_1 ?v13) 
                  (pred_7 ?v12) (pred_2 ?v13))
:effect (and (pred_8 ) (pred_11 ?v13 ?v12) (not (pred_2 ?v13)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_01 obj_22 obj_27 obj_28 obj_17 obj_15 obj_21 obj_03 obj_18 obj_12 obj_04 obj_29 obj_31 obj_16 obj_26 obj_06 obj_20 obj_08 obj_19 obj_11 obj_23 obj_02 obj_14 obj_07 obj_13
    obj_10 obj_05 obj_09
    obj_30 obj_24 obj_25
    )

    (:init
       (pred_8)

       (pred_6 obj_01)
       (pred_6 obj_22)
       (pred_6 obj_27)
       (pred_6 obj_28)
       (pred_6 obj_17)
       (pred_6 obj_15)
       (pred_6 obj_21)
       (pred_6 obj_03)
       (pred_6 obj_18)
       (pred_6 obj_12)
       (pred_6 obj_04)
       (pred_6 obj_29)
       (pred_6 obj_31)
       (pred_6 obj_16)
       (pred_6 obj_26)
       (pred_6 obj_06)
       (pred_6 obj_20)
       (pred_6 obj_08)
       (pred_6 obj_19)
       (pred_6 obj_11)
       (pred_6 obj_23)
       (pred_6 obj_02)
       (pred_6 obj_14)
       (pred_6 obj_07)
       (pred_6 obj_13)
       (pred_5 obj_10)
       (pred_5 obj_05)
       (pred_5 obj_09)
       (pred_1 obj_30)
       (pred_1 obj_24)
       (pred_1 obj_25)

       (pred_9 obj_01 obj_15)
       (pred_9 obj_01 obj_22)
       (pred_9 obj_22 obj_21)
       (pred_9 obj_22 obj_27)
       (pred_9 obj_22 obj_01)
       (pred_9 obj_27 obj_03)
       (pred_9 obj_27 obj_28)
       (pred_9 obj_27 obj_22)
       (pred_9 obj_28 obj_18)
       (pred_9 obj_28 obj_17)
       (pred_9 obj_28 obj_27)
       (pred_9 obj_17 obj_12)
       (pred_9 obj_17 obj_28)
       (pred_9 obj_15 obj_04)
       (pred_9 obj_15 obj_21)
       (pred_9 obj_15 obj_01)
       (pred_9 obj_21 obj_29)
       (pred_9 obj_21 obj_03)
       (pred_9 obj_21 obj_22)
       (pred_9 obj_21 obj_15)
       (pred_9 obj_03 obj_31)
       (pred_9 obj_03 obj_18)
       (pred_9 obj_03 obj_27)
       (pred_9 obj_03 obj_21)
       (pred_9 obj_18 obj_16)
       (pred_9 obj_18 obj_12)
       (pred_9 obj_18 obj_28)
       (pred_9 obj_18 obj_03)
       (pred_9 obj_12 obj_26)
       (pred_9 obj_12 obj_17)
       (pred_9 obj_12 obj_18)
       (pred_9 obj_04 obj_06)
       (pred_9 obj_04 obj_29)
       (pred_9 obj_04 obj_15)
       (pred_9 obj_29 obj_20)
       (pred_9 obj_29 obj_31)
       (pred_9 obj_29 obj_21)
       (pred_9 obj_29 obj_04)
       (pred_9 obj_31 obj_08)
       (pred_9 obj_31 obj_16)
       (pred_9 obj_31 obj_03)
       (pred_9 obj_31 obj_29)
       (pred_9 obj_16 obj_19)
       (pred_9 obj_16 obj_26)
       (pred_9 obj_16 obj_18)
       (pred_9 obj_16 obj_31)
       (pred_9 obj_26 obj_11)
       (pred_9 obj_26 obj_12)
       (pred_9 obj_26 obj_16)
       (pred_9 obj_06 obj_23)
       (pred_9 obj_06 obj_20)
       (pred_9 obj_06 obj_04)
       (pred_9 obj_20 obj_02)
       (pred_9 obj_20 obj_08)
       (pred_9 obj_20 obj_29)
       (pred_9 obj_20 obj_06)
       (pred_9 obj_08 obj_14)
       (pred_9 obj_08 obj_19)
       (pred_9 obj_08 obj_31)
       (pred_9 obj_08 obj_20)
       (pred_9 obj_19 obj_07)
       (pred_9 obj_19 obj_11)
       (pred_9 obj_19 obj_16)
       (pred_9 obj_19 obj_08)
       (pred_9 obj_11 obj_13)
       (pred_9 obj_11 obj_26)
       (pred_9 obj_11 obj_19)
       (pred_9 obj_23 obj_02)
       (pred_9 obj_23 obj_06)
       (pred_9 obj_02 obj_14)
       (pred_9 obj_02 obj_20)
       (pred_9 obj_02 obj_23)
       (pred_9 obj_14 obj_07)
       (pred_9 obj_14 obj_08)
       (pred_9 obj_14 obj_02)
       (pred_9 obj_07 obj_13)
       (pred_9 obj_07 obj_19)
       (pred_9 obj_07 obj_14)
       (pred_9 obj_13 obj_11)
       (pred_9 obj_13 obj_07)
       (pred_10 obj_03)
       (pred_10 obj_26)
       (pred_10 obj_14)
       (pred_12  obj_03 obj_10)
       (pred_12  obj_26 obj_05)
       (pred_12  obj_14 obj_09)
       (pred_4 obj_01)
       (pred_4 obj_22)
       (pred_4 obj_27)
       (pred_4 obj_28)
       (pred_4 obj_17)
       (pred_4 obj_15)
       (pred_4 obj_21)
       (pred_4 obj_18)
       (pred_4 obj_12)
       (pred_4 obj_04)
       (pred_4 obj_29)
       (pred_4 obj_31)
       (pred_4 obj_16)
       (pred_4 obj_06)
       (pred_4 obj_20)
       (pred_4 obj_08)
       (pred_4 obj_19)
       (pred_4 obj_11)
       (pred_4 obj_23)
       (pred_4 obj_02)
       (pred_4 obj_07)
       (pred_4 obj_13)

       (pred_3  obj_30 obj_10)
       (pred_3  obj_24 obj_05)
       (pred_3  obj_25 obj_09)
       (pred_11 obj_30 obj_23)
       (pred_11 obj_24 obj_06)
       (pred_11 obj_25 obj_17)
       (pred_7 obj_17)
    )

    (:goal (and
       (pred_11 obj_24 obj_04)
       (pred_11 obj_25 obj_11)
    ))
(:constraints
  (always (not (pred_7 obj_08)))
)
)

; plan
1. (op_1 obj_17 obj_25)
   deleted: (pred_11 obj_25 obj_17) (pred_8)
   added: (pred_2 obj_25)
   goals met: 0 of 2
2. (op_3 obj_17 obj_28)
   deleted: (pred_7 obj_17)
   added: (pred_7 obj_28)
   goals met: 0 of 2
3. (op_3 obj_28 obj_18)
   deleted: (pred_7 obj_28)
   added: (pred_7 obj_18)
   goals met: 0 of 2
4. (op_3 obj_18 obj_16)
   deleted: (pred_7 obj_18)
   added: (pred_7 obj_16)
   goals met: 0 of 2
5. (op_3 obj_16 obj_19)
   deleted: (pred_7 obj_16)
   added: (pred_7 obj_19)
   goals met: 0 of 2
6. (op_3 obj_19 obj_11)
   deleted: (pred_7 obj_19)
   added: (pred_7 obj_11)
   goals met: 0 of 2
7. (op_2 obj_11 obj_25)
   deleted: (pred_2 obj_25)
   added: (pred_8) (pred_11 obj_25 obj_11)
   goals met: 1 of 2
8. (op_3 obj_11 obj_19)
   deleted: (pred_7 obj_11)
   added: (pred_7 obj_19)
   goals met: 1 of 2
9. (op_3 obj_19 obj_16)
   deleted: (pred_7 obj_19)
   added: (pred_7 obj_16)
   goals met: 1 of 2
10. (op_3 obj_16 obj_31)
   deleted: (pred_7 obj_16)
   added: (pred_7 obj_31)
   goals met: 1 of 2
11. (op_3 obj_31 obj_29)
   deleted: (pred_7 obj_31)
   added: (pred_7 obj_29)
   goals met: 1 of 2
12. (op_3 obj_29 obj_04)
   deleted: (pred_7 obj_29)
   added: (pred_7 obj_04)
   goals met: 1 of 2
13. (op_3 obj_04 obj_06)
   deleted: (pred_7 obj_04)
   added: (pred_7 obj_06)
   goals met: 1 of 2
14. (op_1 obj_06 obj_24)
   deleted: (pred_11 obj_24 obj_06) (pred_8)
   added: (pred_2 obj_24)
   goals met: 1 of 2
15. (op_3 obj_06 obj_04)
   deleted: (pred_7 obj_06)
   added: (pred_7 obj_04)
   goals met: 1 of 2
16. (op_2 obj_04 obj_24)
   deleted: (pred_2 obj_24)
   added: (pred_8) (pred_11 obj_24 obj_04)
   goals met: 2 of 2
